In [20]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23, 35, 45, 36, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [4]:
df.iloc[2]

Name    Charlie
Age:         45
City    Chicago
Name: 2, dtype: object

In [5]:
df.iloc[1]

Name            Bob
Age:             35
City    Los Angeles
Name: 1, dtype: object

In [7]:
df.iloc[:, 1]

0    23
1    35
2    45
3    36
4    28
Name: Age:, dtype: int64

In [9]:
df.iloc[:3]

      Name  Age:         City
0    Alice    23     New York
1      Bob    35  Los Angeles
2  Charlie    45      Chicago

In [11]:
df.iloc[:3, [0, 2]]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [13]:
df.loc[df['Name'] == 'Charlie']

      Name  Age:     City
2  Charlie    45  Chicago

In [14]:
df2 = df.set_index('Name')
print(df2)


david_row = df2.loc['David']
print("\nRow for David:\n", david_row)

         Age:         City
Name
Alice      23     New York
Bob        35  Los Angeles
Charlie    45      Chicago
David      36      Houston
Eva        28      Phoenix

Row for David:
 Age:         36
City    Houston
Name: David, dtype: object

In [23]:
df2.loc[["Bob", "Eva"], ["Age:", "City"]]

      Age:         City
Name
Bob     35  Los Angeles
Eva     28      Phoenix